rkalyan95/CmakeBackup/EmbeddedFramework/include/tle92466.h
#ifndef TLE92446_H
#define TLE92446_H

#include "board.h"

#include "pal_status.h"
#include "pal_assert.h"
#include "pal_spi.h"
#define BASE_ADDR               0x00000000U

#define CH_CTRL_ADDR            (BASE_ADDR + 0x0000)
#define GLOBAL_CONFIG_ADDR      (BASE_ADDR + 0x0002)
#define GLOBAL_DIAG0_ADDR       (BASE_ADDR + 0x0003)
#define GLOBAL_DIAG1_ADDR       (BASE_ADDR + 0x0004)
#define GLOBAL_DIAG2_ADDR       (BASE_ADDR + 0x0005)
#define VBAT_TH_ADDR            (BASE_ADDR + 0x0006)
#define FB_FRZ_ADDR             (BASE_ADDR + 0x0007)
#define FB_UPD_ADDR             (BASE_ADDR + 0x0008)
#define WD_RELOAD_ADDR          (BASE_ADDR + 0x0009)

#define DIAG_ERR_CHGR_ADDR(x)   (BASE_ADDR + 0x000A + (x))
#define DIAG_WARN_CHGR_ADDR(x)  (BASE_ADDR + 0x0010 + (x))

#define FAULT_MASK0_ADDR        (BASE_ADDR + 0x0016)
#define FAULT_MASK1_ADDR        (BASE_ADDR + 0x0017)
#define FAULT_MASK2_ADDR        (BASE_ADDR + 0x0018)

#define CLK_DIV_ADDR            (BASE_ADDR + 0x0019)

#define SFF_BIST_ADDR           (BASE_ADDR + 0x003F)

#define VERSION_ADDR            (BASE_ADDR + 0x0200)
#define PIN_STAT_ADDR           (BASE_ADDR + 0x0201)



#define FB_STAT_ADDR            (BASE_ADDR + 0x0202)
#define FB_VOLTAGE1_ADDR        (BASE_ADDR + 0x0203)
#define FB_VOLTAGE2_ADDR        (BASE_ADDR + 0x0204)

#define CHIPID0_ADDR            (BASE_ADDR + 0x0205)
#define CHIPID1_ADDR            (BASE_ADDR + 0x0206)
#define CHIPID2_ADDR            (BASE_ADDR + 0x0207)


#define CH0_BASE_ADDR               0x00000040U
#define CH1_BASE_ADDR               0x00000050U
#define CH2_BASE_ADDR               0x00000060U
#define CH3_BASE_ADDR               0x00000070U
#define CH4_BASE_ADDR               0x00000020U
#define CH5_BASE_ADDR               0x00000030U

/* Helper macro */
#define CHANNEL_BASE_ADDR(ch)       ((ch) == 0 ? CH0_BASE_ADDR : \
                                     (ch) == 1 ? CH1_BASE_ADDR : \
                                     (ch) == 2 ? CH2_BASE_ADDR : \
                                     (ch) == 3 ? CH3_BASE_ADDR : \
                                     (ch) == 4 ? CH4_BASE_ADDR : \
                                                 CH5_BASE_ADDR)

#define SETPOINT_ADDR(base)             ((base) + 0x0000U)
#define CTRL_ADDR(base)                 ((base) + 0x0001U)
#define PERIOD_ADDR(base)               ((base) + 0x0002U)
#define INTEGRATOR_LIMIT_ADDR(base)     ((base) + 0x0003U)
#define DITHER_CLK_DIV_ADDR(base)       ((base) + 0x0004U)
#define DITHER_STEP_ADDR(base)          ((base) + 0x0005U)
#define DITHER_CTRL_ADDR(base)          ((base) + 0x0006U)
#define CH_CONFIG_ADDR(base)            ((base) + 0x0007U)

#define MODE_ADDR(base)                 ((base) + 0x000CU)
#define TON_ADDR(base)                  ((base) + 0x000DU)
#define CTRL_INT_THRESH_ADDR(base)      ((base) + 0x000EU)

#define FB_DC_ADDR(base)                ((base) + 0x0200U)
#define FB_VBAT_ADDR(base)              ((base) + 0x0201U)
#define FB_I_AVG_ADDR(base)             ((base) + 0x0202U)
#define FB_IMIN_IMAX_ADDR(base)         ((base) + 0x0203U)
#define FB_I_AVG_S16_ADDR(base)         ((base) + 0x0204U)
#define FB_INT_THRESH_ADDR(base)        ((base) + 0x0205U)
#define FB_PERIOD_MIN_MAX_ADDR(base)    ((base) + 0x0206U)


/* ============================================================
 * CH_CTRL
 * ============================================================ */

#define CH_CTRL_EN_CH0_pos                     0U
#define CH_CTRL_EN_CH0_msk                     (1U << CH_CTRL_EN_CH0_pos)

#define CH_CTRL_EN_CH1_pos                     1U
#define CH_CTRL_EN_CH1_msk                     (1U << CH_CTRL_EN_CH1_pos)

#define CH_CTRL_EN_CH2_pos                     2U
#define CH_CTRL_EN_CH2_msk                     (1U << CH_CTRL_EN_CH2_pos)

#define CH_CTRL_EN_CH3_pos                     3U
#define CH_CTRL_EN_CH3_msk                     (1U << CH_CTRL_EN_CH3_pos)

#define CH_CTRL_EN_CH4_pos                     4U
#define CH_CTRL_EN_CH4_msk                     (1U << CH_CTRL_EN_CH4_pos)

#define CH_CTRL_EN_CH5_pos                     5U
#define CH_CTRL_EN_CH5_msk                     (1U << CH_CTRL_EN_CH5_pos)

#define CH_CTRL_CH_PAR_4_5_pos                12U
#define CH_CTRL_CH_PAR_4_5_msk                (1U << CH_CTRL_CH_PAR_4_5_pos)

#define CH_CTRL_CH_PAR_0_3_pos                13U
#define CH_CTRL_CH_PAR_0_3_msk                (1U << CH_CTRL_CH_PAR_0_3_pos)

#define CH_CTRL_CH_PAR_1_2_pos                14U
#define CH_CTRL_CH_PAR_1_2_msk                (1U << CH_CTRL_CH_PAR_1_2_pos)

#define CH_CTRL_OP_MODE_pos                   15U
#define CH_CTRL_OP_MODE_msk                   (1U << CH_CTRL_OP_MODE_pos)


/* ============================================================
 * GLOBAL_CONFIG
 * ============================================================ */

#define GLOBAL_CONFIG_CLK_WD_EN_pos            0U
#define GLOBAL_CONFIG_CLK_WD_EN_msk            (1U << GLOBAL_CONFIG_CLK_WD_EN_pos)

#define GLOBAL_CONFIG_SPI_WD_EN_pos            1U
#define GLOBAL_CONFIG_SPI_WD_EN_msk            (1U << GLOBAL_CONFIG_SPI_WD_EN_pos)

#define GLOBAL_CONFIG_CRC_EN_pos               2U
#define GLOBAL_CONFIG_CRC_EN_msk               (1U << GLOBAL_CONFIG_CRC_EN_pos)

#define GLOBAL_CONFIG_V1V5_UV_TEST_pos         4U
#define GLOBAL_CONFIG_V1V5_UV_TEST_msk         (1U << GLOBAL_CONFIG_V1V5_UV_TEST_pos)

#define GLOBAL_CONFIG_V1V5_OV_TEST_pos         5U
#define GLOBAL_CONFIG_V1V5_OV_TEST_msk         (1U << GLOBAL_CONFIG_V1V5_OV_TEST_pos)

#define GLOBAL_CONFIG_OT_TEST_pos             12U
#define GLOBAL_CONFIG_OT_TEST_msk             (1U << GLOBAL_CONFIG_OT_TEST_pos)

#define GLOBAL_CONFIG_UV_OV_SWAP_pos          13U
#define GLOBAL_CONFIG_UV_OV_SWAP_msk          (1U << GLOBAL_CONFIG_UV_OV_SWAP_pos)

#define GLOBAL_CONFIG_VIO_SEL_pos              14U
#define GLOBAL_CONFIG_VIO_SEL_msk              (1U << GLOBAL_CONFIG_VIO_SEL_pos)


/* ============================================================
 * GLOBAL_DIAG0
 * ============================================================ */

#define GLOBAL_DIAG0_VBAT_UV_pos               0U
#define GLOBAL_DIAG0_VBAT_UV_msk               (1U << GLOBAL_DIAG0_VBAT_UV_pos)

