rkalyan95/CmakeBackup/EmbeddedFramework/include/tle92466.h
#define GLOBAL_DIAG0_VBAT_OV_pos               1U
#define GLOBAL_DIAG0_VBAT_OV_msk               (1U << GLOBAL_DIAG0_VBAT_OV_pos)

#define GLOBAL_DIAG0_VIO_UV_pos                2U
#define GLOBAL_DIAG0_VIO_UV_msk                (1U << GLOBAL_DIAG0_VIO_UV_pos)

#define GLOBAL_DIAG0_VIO_OV_pos                3U
#define GLOBAL_DIAG0_VIO_OV_msk                (1U << GLOBAL_DIAG0_VIO_OV_pos)

#define GLOBAL_DIAG0_VDD_UV_pos                4U
#define GLOBAL_DIAG0_VDD_UV_msk                (1U << GLOBAL_DIAG0_VDD_UV_pos)

#define GLOBAL_DIAG0_VDD_OV_pos                5U
#define GLOBAL_DIAG0_VDD_OV_msk                (1U << GLOBAL_DIAG0_VDD_OV_pos)

#define GLOBAL_DIAG0_CLK_NOK_pos               6U
#define GLOBAL_DIAG0_CLK_NOK_msk               (1U << GLOBAL_DIAG0_CLK_NOK_pos)

#define GLOBAL_DIAG0_COTERR_pos                7U
#define GLOBAL_DIAG0_COTERR_msk                (1U << GLOBAL_DIAG0_COTERR_pos)

#define GLOBAL_DIAG0_COTWARN_pos               8U
#define GLOBAL_DIAG0_COTWARN_msk               (1U << GLOBAL_DIAG0_COTWARN_pos)

#define GLOBAL_DIAG0_RES_EVENT_pos             9U
#define GLOBAL_DIAG0_RES_EVENT_msk             (1U << GLOBAL_DIAG0_RES_EVENT_pos)

#define GLOBAL_DIAG0_POR_EVENT_pos            10U
#define GLOBAL_DIAG0_POR_EVENT_msk            (1U << GLOBAL_DIAG0_POR_EVENT_pos)

#define GLOBAL_DIAG0_SPI_WD_ERR_pos           14U
#define GLOBAL_DIAG0_SPI_WD_ERR_msk           (1U << GLOBAL_DIAG0_SPI_WD_ERR_pos)


/* ============================================================
 * GLOBAL_DIAG1
 * ============================================================ */

#define GLOBAL_DIAG1_VR_IREF_UV_pos            0U
#define GLOBAL_DIAG1_VR_IREF_UV_msk            (1U << GLOBAL_DIAG1_VR_IREF_UV_pos)

#define GLOBAL_DIAG1_VR_IREF_OV_pos            1U
#define GLOBAL_DIAG1_VR_IREF_OV_msk            (1U << GLOBAL_DIAG1_VR_IREF_OV_pos)

#define GLOBAL_DIAG1_VDD2V5_UV_pos             2U
#define GLOBAL_DIAG1_VDD2V5_UV_msk             (1U << GLOBAL_DIAG1_VDD2V5_UV_pos)

#define GLOBAL_DIAG1_VDD2V5_OV_pos             3U
#define GLOBAL_DIAG1_VDD2V5_OV_msk             (1U << GLOBAL_DIAG1_VDD2V5_OV_pos)

#define GLOBAL_DIAG1_REF_UV_pos                4U
#define GLOBAL_DIAG1_REF_UV_msk                (1U << GLOBAL_DIAG1_REF_UV_pos)

#define GLOBAL_DIAG1_REF_OV_pos                5U
#define GLOBAL_DIAG1_REF_OV_msk                (1U << GLOBAL_DIAG1_REF_OV_pos)

#define GLOBAL_DIAG1_VPRE_OV_pos               6U
#define GLOBAL_DIAG1_VPRE_OV_msk               (1U << GLOBAL_DIAG1_VPRE_OV_pos)

#define GLOBAL_DIAG1_HVADC_ERR_pos            15U
#define GLOBAL_DIAG1_HVADC_ERR_msk            (1U << GLOBAL_DIAG1_HVADC_ERR_pos)


/* ============================================================
 * GLOBAL_DIAG2
 * ============================================================ */

#define GLOBAL_DIAG2_REG_ECC_ERR_pos            1U
#define GLOBAL_DIAG2_REG_ECC_ERR_msk            (1U << GLOBAL_DIAG2_REG_ECC_ERR_pos)

#define GLOBAL_DIAG2_OTP_ECC_ERR_pos            3U
#define GLOBAL_DIAG2_OTP_ECC_ERR_msk            (1U << GLOBAL_DIAG2_OTP_ECC_ERR_pos)

#define GLOBAL_DIAG2_OTP_VIRGIN_pos             4U
#define GLOBAL_DIAG2_OTP_VIRGIN_msk             (1U << GLOBAL_DIAG2_OTP_VIRGIN_pos)


/* ============================================================
 * VBAT_TH
 * ============================================================ */

#define VBAT_TH_VBAT_UV_TH_pos                 0U
#define VBAT_TH_VBAT_UV_TH_msk                 (0xFFU << VBAT_TH_VBAT_UV_TH_pos)

#define VBAT_TH_VBAT_OV_TH_pos                 8U
#define VBAT_TH_VBAT_OV_TH_msk                 (0xFFU << VBAT_TH_VBAT_OV_TH_pos)


/* ============================================================
 * FB_FRZ
 * ============================================================ */

#define FB_FRZ_FR_CH0_pos                       0U
#define FB_FRZ_FR_CH0_msk                       (1U << FB_FRZ_FR_CH0_pos)

#define FB_FRZ_FR_CH1_pos                       1U
#define FB_FRZ_FR_CH1_msk                       (1U << FB_FRZ_FR_CH1_pos)

#define FB_FRZ_FR_CH2_pos                       2U
#define FB_FRZ_FR_CH2_msk                       (1U << FB_FRZ_FR_CH2_pos)

#define FB_FRZ_FR_CH3_pos                       3U
#define FB_FRZ_FR_CH3_msk                       (1U << FB_FRZ_FR_CH3_pos)

#define FB_FRZ_FR_CH4_pos                       4U
#define FB_FRZ_FR_CH4_msk                       (1U << FB_FRZ_FR_CH4_pos)

#define FB_FRZ_FR_CH5_pos                       5U
#define FB_FRZ_FR_CH5_msk                       (1U << FB_FRZ_FR_CH5_pos)


/* ============================================================
 * FB_UPD
 * ============================================================ */

#define FB_UPD_UD_CH0_pos                       0U
#define FB_UPD_UD_CH0_msk                       (1U << FB_UPD_UD_CH0_pos)

#define FB_UPD_UD_CH1_pos                       1U
#define FB_UPD_UD_CH1_msk                       (1U << FB_UPD_UD_CH1_pos)

#define FB_UPD_UD_CH2_pos                       2U
#define FB_UPD_UD_CH2_msk                       (1U << FB_UPD_UD_CH2_pos)

#define FB_UPD_UD_CH3_pos                       3U
#define FB_UPD_UD_CH3_msk                       (1U << FB_UPD_UD_CH3_pos)

#define FB_UPD_UD_CH4_pos                       4U
#define FB_UPD_UD_CH4_msk                       (1U << FB_UPD_UD_CH4_pos)

#define FB_UPD_UD_CH5_pos                       5U
#define FB_UPD_UD_CH5_msk                       (1U << FB_UPD_UD_CH5_pos)


/* ============================================================
 * WD_RELOAD
 * ============================================================ */

#define WD_RELOAD_WD_TIME_pos                   0U
#define WD_RELOAD_WD_TIME_msk                   (0x7FFU << WD_RELOAD_WD_TIME_pos)


/* ============================================================
 * DIAG_ERR_CHGR0
 * ============================================================ */

#define DIAG_ERR_CHGR0_OLSG_CH0_pos             0U
#define DIAG_ERR_CHGR0_OLSG_CH0_msk             (1U << DIAG_ERR_CHGR0_OLSG_CH0_pos)

#define DIAG_ERR_CHGR0_OL_CH0_pos               1U
#define DIAG_ERR_CHGR0_OL_CH0_msk               (1U << DIAG_ERR_CHGR0_OL_CH0_pos)

#define DIAG_ERR_CHGR0_OC_CH0_pos               2U
#define DIAG_ERR_CHGR0_OC_CH0_msk               (1U << DIAG_ERR_CHGR0_OC_CH0_pos)

#define DIAG_ERR_CHGR0_SG_CH0_pos               3U
#define DIAG_ERR_CHGR0_SG_CH0_msk               (1U << DIAG_ERR_CHGR0_SG_CH0_pos)

#define DIAG_ERR_CHGR0_OTE_CH0_pos              4U
#define DIAG_ERR_CHGR0_OTE_CH0_msk              (1U << DIAG_ERR_CHGR0_OTE_CH0_pos)

#define DIAG_ERR_CHGR0_OLSG_CH1_pos             8U
#define DIAG_ERR_CHGR0_OLSG_CH1_msk             (1U << DIAG_ERR_CHGR0_OLSG_CH1_pos)

#define DIAG_ERR_CHGR0_OL_CH1_pos               9U
#define DIAG_ERR_CHGR0_OL_CH1_msk               (1U << DIAG_ERR_CHGR0_OL_CH1_pos)

#define DIAG_ERR_CHGR0_OC_CH1_pos              10U
#define DIAG_ERR_CHGR0_OC_CH1_msk              (1U << DIAG_ERR_CHGR0_OC_CH1_pos)

#define DIAG_ERR_CHGR0_SG_CH1_pos              11U
#define DIAG_ERR_CHGR0_SG_CH1_msk              (1U << DIAG_ERR_CHGR0_SG_CH1_pos)

#define DIAG_ERR_CHGR0_OTE_CH1_pos             12U
#define DIAG_ERR_CHGR0_OTE_CH1_msk             (1U << DIAG_ERR_CHGR0_OTE_CH1_pos)


/* ============================================================
 * DIAG_ERR_CHGR1
 * ============================================================ */

#define DIAG_ERR_CHGR1_OLSG_CH2_pos             0U
#define DIAG_ERR_CHGR1_OLSG_CH2_msk             (1U << DIAG_ERR_CHGR1_OLSG_CH2_pos)

#define DIAG_ERR_CHGR1_OL_CH2_pos               1U
#define DIAG_ERR_CHGR1_OL_CH2_msk               (1U << DIAG_ERR_CHGR1_OL_CH2_pos)

#define DIAG_ERR_CHGR1_OC_CH2_pos               2U
#define DIAG_ERR_CHGR1_OC_CH2_msk               (1U << DIAG_ERR_CHGR1_OC_CH2_pos)

#define DIAG_ERR_CHGR1_SG_CH2_pos               3U
#define DIAG_ERR_CHGR1_SG_CH2_msk               (1U << DIAG_ERR_CHGR1_SG_CH2_pos)

#define DIAG_ERR_CHGR1_OTE_CH2_pos              4U
#define DIAG_ERR_CHGR1_OTE_CH2_msk              (1U << DIAG_ERR_CHGR1_OTE_CH2_pos)

#define DIAG_ERR_CHGR1_OLSG_CH3_pos             8U
#define DIAG_ERR_CHGR1_OLSG_CH3_msk             (1U << DIAG_ERR_CHGR1_OLSG_CH3_pos)

#define DIAG_ERR_CHGR1_OL_CH3_pos               9U
#define DIAG_ERR_CHGR1_OL_CH3_msk               (1U << DIAG_ERR_CHGR1_OL_CH3_pos)

#define DIAG_ERR_CHGR1_OC_CH3_pos              10U
#define DIAG_ERR_CHGR1_OC_CH3_msk              (1U << DIAG_ERR_CHGR1_OC_CH3_pos)

#define DIAG_ERR_CHGR1_SG_CH3_pos              11U
#define DIAG_ERR_CHGR1_SG_CH3_msk              (1U << DIAG_ERR_CHGR1_SG_CH3_pos)

