rkalyan95/CmakeBackup/EmbeddedFramework/include/tle92466.h
#define DIAG_ERR_CHGR1_OTE_CH3_pos             12U
#define DIAG_ERR_CHGR1_OTE_CH3_msk             (1U << DIAG_ERR_CHGR1_OTE_CH3_pos)


/* ============================================================
 * DIAG_ERR_CHGR2
 * ============================================================ */

#define DIAG_ERR_CHGR2_OLSG_CH4_pos             0U
#define DIAG_ERR_CHGR2_OLSG_CH4_msk             (1U << DIAG_ERR_CHGR2_OLSG_CH4_pos)

#define DIAG_ERR_CHGR2_OL_CH4_pos               1U
#define DIAG_ERR_CHGR2_OL_CH4_msk               (1U << DIAG_ERR_CHGR2_OL_CH4_pos)

#define DIAG_ERR_CHGR2_OC_CH4_pos               2U
#define DIAG_ERR_CHGR2_OC_CH4_msk               (1U << DIAG_ERR_CHGR2_OC_CH4_pos)

#define DIAG_ERR_CHGR2_SG_CH4_pos               3U
#define DIAG_ERR_CHGR2_SG_CH4_msk               (1U << DIAG_ERR_CHGR2_SG_CH4_pos)

#define DIAG_ERR_CHGR2_OTE_CH4_pos              4U
#define DIAG_ERR_CHGR2_OTE_CH4_msk              (1U << DIAG_ERR_CHGR2_OTE_CH4_pos)

#define DIAG_ERR_CHGR2_OLSG_CH5_pos             8U
#define DIAG_ERR_CHGR2_OLSG_CH5_msk             (1U << DIAG_ERR_CHGR2_OLSG_CH5_pos)

#define DIAG_ERR_CHGR2_OL_CH5_pos               9U
#define DIAG_ERR_CHGR2_OL_CH5_msk               (1U << DIAG_ERR_CHGR2_OL_CH5_pos)

#define DIAG_ERR_CHGR2_OC_CH5_pos              10U
#define DIAG_ERR_CHGR2_OC_CH5_msk              (1U << DIAG_ERR_CHGR2_OC_CH5_pos)

#define DIAG_ERR_CHGR2_SG_CH5_pos              11U
#define DIAG_ERR_CHGR2_SG_CH5_msk              (1U << DIAG_ERR_CHGR2_SG_CH5_pos)

#define DIAG_ERR_CHGR2_OTE_CH5_pos             12U
#define DIAG_ERR_CHGR2_OTE_CH5_msk             (1U << DIAG_ERR_CHGR2_OTE_CH5_pos)


/* ============================================================
 * DIAG_WARN_CHGR0
 * ============================================================ */

#define DIAG_WARN_CHGR0_PWM_REG_WARN_CH0_pos              0U
#define DIAG_WARN_CHGR0_PWM_REG_WARN_CH0_msk              (1U << DIAG_WARN_CHGR0_PWM_REG_WARN_CH0_pos)

#define DIAG_WARN_CHGR0_I_REG_WARN_CH0_pos                1U
#define DIAG_WARN_CHGR0_I_REG_WARN_CH0_msk                (1U << DIAG_WARN_CHGR0_I_REG_WARN_CH0_pos)

#define DIAG_WARN_CHGR0_OTW_CH0_pos                       2U
#define DIAG_WARN_CHGR0_OTW_CH0_msk                       (1U << DIAG_WARN_CHGR0_OTW_CH0_pos)

#define DIAG_WARN_CHGR0_OLSG_WARN_CH0_pos                 3U
#define DIAG_WARN_CHGR0_OLSG_WARN_CH0_msk                 (1U << DIAG_WARN_CHGR0_OLSG_WARN_CH0_pos)

#define DIAG_WARN_CHGR0_OLSG_WARN_CHK_NOK_CH0_pos         4U
#define DIAG_WARN_CHGR0_OLSG_WARN_CHK_NOK_CH0_msk         (1U << DIAG_WARN_CHGR0_OLSG_WARN_CHK_NOK_CH0_pos)

#define DIAG_WARN_CHGR0_PWM_REG_WARN_CH1_pos              8U
#define DIAG_WARN_CHGR0_PWM_REG_WARN_CH1_msk              (1U << DIAG_WARN_CHGR0_PWM_REG_WARN_CH1_pos)

#define DIAG_WARN_CHGR0_I_REG_WARN_CH1_pos                9U
#define DIAG_WARN_CHGR0_I_REG_WARN_CH1_msk                (1U << DIAG_WARN_CHGR0_I_REG_WARN_CH1_pos)

#define DIAG_WARN_CHGR0_OTW_CH1_pos                      10U
#define DIAG_WARN_CHGR0_OTW_CH1_msk                      (1U << DIAG_WARN_CHGR0_OTW_CH1_pos)

#define DIAG_WARN_CHGR0_OLSG_WARN_CH1_pos                11U
#define DIAG_WARN_CHGR0_OLSG_WARN_CH1_msk                (1U << DIAG_WARN_CHGR0_OLSG_WARN_CH1_pos)

#define DIAG_WARN_CHGR0_OLSG_WARN_CHK_NOK_CH1_pos        12U
#define DIAG_WARN_CHGR0_OLSG_WARN_CHK_NOK_CH1_msk        (1U << DIAG_WARN_CHGR0_OLSG_WARN_CHK_NOK_CH1_pos)


/* ============================================================
 * DIAG_WARN_CHGR1
 * ============================================================ */

#define DIAG_WARN_CHGR1_PWM_REG_WARN_CH2_pos              0U
#define DIAG_WARN_CHGR1_PWM_REG_WARN_CH2_msk              (1U << DIAG_WARN_CHGR1_PWM_REG_WARN_CH2_pos)

#define DIAG_WARN_CHGR1_I_REG_WARN_CH2_pos                1U
#define DIAG_WARN_CHGR1_I_REG_WARN_CH2_msk                (1U << DIAG_WARN_CHGR1_I_REG_WARN_CH2_pos)

#define DIAG_WARN_CHGR1_OTW_CH2_pos                       2U
#define DIAG_WARN_CHGR1_OTW_CH2_msk                       (1U << DIAG_WARN_CHGR1_OTW_CH2_pos)

#define DIAG_WARN_CHGR1_OLSG_WARN_CH2_pos                 3U
#define DIAG_WARN_CHGR1_OLSG_WARN_CH2_msk                 (1U << DIAG_WARN_CHGR1_OLSG_WARN_CH2_pos)

#define DIAG_WARN_CHGR1_OLSG_WARN_CHK_NOK_CH2_pos         4U
#define DIAG_WARN_CHGR1_OLSG_WARN_CHK_NOK_CH2_msk         (1U << DIAG_WARN_CHGR1_OLSG_WARN_CHK_NOK_CH2_pos)

#define DIAG_WARN_CHGR1_PWM_REG_WARN_CH3_pos              8U
#define DIAG_WARN_CHGR1_PWM_REG_WARN_CH3_msk              (1U << DIAG_WARN_CHGR1_PWM_REG_WARN_CH3_pos)

#define DIAG_WARN_CHGR1_I_REG_WARN_CH3_pos                9U
#define DIAG_WARN_CHGR1_I_REG_WARN_CH3_msk                (1U << DIAG_WARN_CHGR1_I_REG_WARN_CH3_pos)

#define DIAG_WARN_CHGR1_OTW_CH3_pos                      10U
#define DIAG_WARN_CHGR1_OTW_CH3_msk                      (1U << DIAG_WARN_CHGR1_OTW_CH3_pos)

#define DIAG_WARN_CHGR1_OLSG_WARN_CH3_pos                11U
#define DIAG_WARN_CHGR1_OLSG_WARN_CH3_msk                (1U << DIAG_WARN_CHGR1_OLSG_WARN_CH3_pos)

#define DIAG_WARN_CHGR1_OLSG_WARN_CHK_NOK_CH3_pos        12U
#define DIAG_WARN_CHGR1_OLSG_WARN_CHK_NOK_CH3_msk        (1U << DIAG_WARN_CHGR1_OLSG_WARN_CHK_NOK_CH3_pos)


/* ============================================================
 * DIAG_WARN_CHGR2
 * ============================================================ */

#define DIAG_WARN_CHGR2_PWM_REG_WARN_CH4_pos              0U
#define DIAG_WARN_CHGR2_PWM_REG_WARN_CH4_msk              (1U << DIAG_WARN_CHGR2_PWM_REG_WARN_CH4_pos)

#define DIAG_WARN_CHGR2_I_REG_WARN_CH4_pos                1U
#define DIAG_WARN_CHGR2_I_REG_WARN_CH4_msk                (1U << DIAG_WARN_CHGR2_I_REG_WARN_CH4_pos)

#define DIAG_WARN_CHGR2_OTW_CH4_pos                       2U
#define DIAG_WARN_CHGR2_OTW_CH4_msk                       (1U << DIAG_WARN_CHGR2_OTW_CH4_pos)

#define DIAG_WARN_CHGR2_OLSG_WARN_CH4_pos                 3U
#define DIAG_WARN_CHGR2_OLSG_WARN_CH4_msk                 (1U << DIAG_WARN_CHGR2_OLSG_WARN_CH4_pos)

#define DIAG_WARN_CHGR2_OLSG_WARN_CHK_NOK_CH4_pos         4U
#define DIAG_WARN_CHGR2_OLSG_WARN_CHK_NOK_CH4_msk         (1U << DIAG_WARN_CHGR2_OLSG_WARN_CHK_NOK_CH4_pos)

