rkalyan95/CmakeBackup/EmbeddedFramework/include/tle92466.h
#define DIAG_WARN_CHGR2_PWM_REG_WARN_CH5_pos              8U
#define DIAG_WARN_CHGR2_PWM_REG_WARN_CH5_msk              (1U << DIAG_WARN_CHGR2_PWM_REG_WARN_CH5_pos)

#define DIAG_WARN_CHGR2_I_REG_WARN_CH5_pos                9U
#define DIAG_WARN_CHGR2_I_REG_WARN_CH5_msk                (1U << DIAG_WARN_CHGR2_I_REG_WARN_CH5_pos)

#define DIAG_WARN_CHGR2_OTW_CH5_pos                      10U
#define DIAG_WARN_CHGR2_OTW_CH5_msk                      (1U << DIAG_WARN_CHGR2_OTW_CH5_pos)

#define DIAG_WARN_CHGR2_OLSG_WARN_CH5_pos                11U
#define DIAG_WARN_CHGR2_OLSG_WARN_CH5_msk                (1U << DIAG_WARN_CHGR2_OLSG_WARN_CH5_pos)

#define DIAG_WARN_CHGR2_OLSG_WARN_CHK_NOK_CH5_pos        12U
#define DIAG_WARN_CHGR2_OLSG_WARN_CHK_NOK_CH5_msk        (1U << DIAG_WARN_CHGR2_OLSG_WARN_CHK_NOK_CH5_pos)


/* ============================================================
 * FAULT_MASK0
 * ============================================================ */

#define FAULT_MASK0_CH0_ERR_MASK_pos        0U
#define FAULT_MASK0_CH0_ERR_MASK_msk        (1U << FAULT_MASK0_CH0_ERR_MASK_pos)

#define FAULT_MASK0_CH1_ERR_MASK_pos        1U
#define FAULT_MASK0_CH1_ERR_MASK_msk        (1U << FAULT_MASK0_CH1_ERR_MASK_pos)

#define FAULT_MASK0_CH2_ERR_MASK_pos        2U
#define FAULT_MASK0_CH2_ERR_MASK_msk        (1U << FAULT_MASK0_CH2_ERR_MASK_pos)

#define FAULT_MASK0_CH3_ERR_MASK_pos        3U
#define FAULT_MASK0_CH3_ERR_MASK_msk        (1U << FAULT_MASK0_CH3_ERR_MASK_pos)

#define FAULT_MASK0_CH4_ERR_MASK_pos        4U
#define FAULT_MASK0_CH4_ERR_MASK_msk        (1U << FAULT_MASK0_CH4_ERR_MASK_pos)

#define FAULT_MASK0_CH5_ERR_MASK_pos        5U
#define FAULT_MASK0_CH5_ERR_MASK_msk        (1U << FAULT_MASK0_CH5_ERR_MASK_pos)

#define FAULT_MASK0_EN_PIN_MASK_pos        13U
#define FAULT_MASK0_EN_PIN_MASK_msk        (1U << FAULT_MASK0_EN_PIN_MASK_pos)

#define FAULT_MASK0_SUP_NOK_INT_MASK_pos   14U
#define FAULT_MASK0_SUP_NOK_INT_MASK_msk   (1U << FAULT_MASK0_SUP_NOK_INT_MASK_pos)

#define FAULT_MASK0_SUP_NOK_EXT_MASK_pos   15U
#define FAULT_MASK0_SUP_NOK_EXT_MASK_msk   (1U << FAULT_MASK0_SUP_NOK_EXT_MASK_pos)


/* ============================================================
 * FAULT_MASK1
 * ============================================================ */

#define FAULT_MASK1_CH0_WARN_MASK_pos       0U
#define FAULT_MASK1_CH0_WARN_MASK_msk       (1U << FAULT_MASK1_CH0_WARN_MASK_pos)

#define FAULT_MASK1_CH1_WARN_MASK_pos       1U
#define FAULT_MASK1_CH1_WARN_MASK_msk       (1U << FAULT_MASK1_CH1_WARN_MASK_pos)

#define FAULT_MASK1_CH2_WARN_MASK_pos       2U
#define FAULT_MASK1_CH2_WARN_MASK_msk       (1U << FAULT_MASK1_CH2_WARN_MASK_pos)

#define FAULT_MASK1_CH3_WARN_MASK_pos       3U
#define FAULT_MASK1_CH3_WARN_MASK_msk       (1U << FAULT_MASK1_CH3_WARN_MASK_pos)

#define FAULT_MASK1_CH4_WARN_MASK_pos       4U
#define FAULT_MASK1_CH4_WARN_MASK_msk       (1U << FAULT_MASK1_CH4_WARN_MASK_pos)

#define FAULT_MASK1_CH5_WARN_MASK_pos       5U
#define FAULT_MASK1_CH5_WARN_MASK_msk       (1U << FAULT_MASK1_CH5_WARN_MASK_pos)

#define FAULT_MASK1_COTWARN_MASK_pos       12U
#define FAULT_MASK1_COTWARN_MASK_msk       (1U << FAULT_MASK1_COTWARN_MASK_pos)

#define FAULT_MASK1_COTERR_MASK_pos        13U
#define FAULT_MASK1_COTERR_MASK_msk        (1U << FAULT_MASK1_COTERR_MASK_pos)

#define FAULT_MASK1_CLK_LOW_MASK_pos       14U
#define FAULT_MASK1_CLK_LOW_MASK_msk       (1U << FAULT_MASK1_CLK_LOW_MASK_pos)


/* ============================================================
 * FAULT_MASK2
 * ============================================================ */

#define FAULT_MASK2_DATA_ERR_MASK_pos       14U
#define FAULT_MASK2_DATA_ERR_MASK_msk       (1U << FAULT_MASK2_DATA_ERR_MASK_pos)

#define FAULT_MASK2_SPI_WD_MASK_pos         15U
#define FAULT_MASK2_SPI_WD_MASK_msk         (1U << FAULT_MASK2_SPI_WD_MASK_pos)


/* ============================================================
 * CLK_DIV
 * ============================================================ */

#define CLK_DIV_PLL_FBDIV_pos               0U
#define CLK_DIV_PLL_FBDIV_msk               (0x1FFU << CLK_DIV_PLL_FBDIV_pos)

#define CLK_DIV_PLL_REFDIV_pos              9U
#define CLK_DIV_PLL_REFDIV_msk              (0x3FU << CLK_DIV_PLL_REFDIV_pos)

#define CLK_DIV_EXT_CLK_pos                15U
#define CLK_DIV_EXT_CLK_msk                (1U << CLK_DIV_EXT_CLK_pos)


/* ============================================================
 * SFF_BIST
 * ============================================================ */

#define SFF_BIST_SMU_SLF_TST_EN_pos        0U
#define SFF_BIST_SMU_SLF_TST_EN_msk        (1U << SFF_BIST_SMU_SLF_TST_EN_pos)

#define SFF_BIST_SMU_SLF_TST_DONE_pos      1U
#define SFF_BIST_SMU_SLF_TST_DONE_msk      (1U << SFF_BIST_SMU_SLF_TST_DONE_pos)

#define SFF_BIST_SMU_SLF_TST_FAIL_pos      2U
#define SFF_BIST_SMU_SLF_TST_FAIL_msk      (1U << SFF_BIST_SMU_SLF_TST_FAIL_pos)

#define SFF_BIST_SMU_SLF_TST_UERR_pos      3U
#define SFF_BIST_SMU_SLF_TST_UERR_msk      (1U << SFF_BIST_SMU_SLF_TST_UERR_pos)

#define SFF_BIST_SMU_SLF_TST_CERR_pos      4U
#define SFF_BIST_SMU_SLF_TST_CERR_msk      (1U << SFF_BIST_SMU_SLF_TST_CERR_pos)


/* ============================================================
 * ICVID
 * ============================================================ */

#define ICVID_VERSION_pos                   0U
#define ICVID_VERSION_msk                   (0xFFU << ICVID_VERSION_pos)

#define ICVID_MANUFACTURER_pos              8U
#define ICVID_MANUFACTURER_msk              (0xFFU << ICVID_MANUFACTURER_pos)


/* ============================================================
 * PIN_STAT
 * ============================================================ */

#define PIN_STAT_DRV0_pos                   0U
#define PIN_STAT_DRV0_msk                   (1U << PIN_STAT_DRV0_pos)

#define PIN_STAT_DRV1_pos                   1U
#define PIN_STAT_DRV1_msk                   (1U << PIN_STAT_DRV1_pos)

#define PIN_STAT_EN_pos                     4U
#define PIN_STAT_EN_msk                     (1U << PIN_STAT_EN_pos)

#define PIN_STAT_FAULTN_pos                 5U
#define PIN_STAT_FAULTN_msk                 (1U << PIN_STAT_FAULTN_pos)

#define PIN_STAT_FAULTN_FB_pos              6U
#define PIN_STAT_FAULTN_FB_msk              (1U << PIN_STAT_FAULTN_FB_pos)


/* ============================================================
 * FB_STAT
 * ============================================================ */

#define FB_STAT_DIAG_WARN_CHGR0_pos          0U
#define FB_STAT_DIAG_WARN_CHGR0_msk          (1U << FB_STAT_DIAG_WARN_CHGR0_pos)

