rkalyan95/CmakeBackup/EmbeddedFramework/include/tle92466.h
#define FB_STAT_DIAG_WARN_CHGR1_pos          1U
#define FB_STAT_DIAG_WARN_CHGR1_msk          (1U << FB_STAT_DIAG_WARN_CHGR1_pos)

#define FB_STAT_DIAG_WARN_CHGR2_pos          2U
#define FB_STAT_DIAG_WARN_CHGR2_msk          (1U << FB_STAT_DIAG_WARN_CHGR2_pos)

#define FB_STAT_OLSG_WARN_CHK_NOK_CHGR0_pos  3U
#define FB_STAT_OLSG_WARN_CHK_NOK_CHGR0_msk  (1U << FB_STAT_OLSG_WARN_CHK_NOK_CHGR0_pos)

#define FB_STAT_OLSG_WARN_CHK_NOK_CHGR1_pos  4U
#define FB_STAT_OLSG_WARN_CHK_NOK_CHGR1_msk  (1U << FB_STAT_OLSG_WARN_CHK_NOK_CHGR1_pos)

#define FB_STAT_OLSG_WARN_CHK_NOK_CHGR2_pos  5U
#define FB_STAT_OLSG_WARN_CHK_NOK_CHGR2_msk  (1U << FB_STAT_OLSG_WARN_CHK_NOK_CHGR2_pos)

#define FB_STAT_CLK_NOK_pos                  6U
#define FB_STAT_CLK_NOK_msk                  (1U << FB_STAT_CLK_NOK_pos)

#define FB_STAT_COTERR_pos                   7U
#define FB_STAT_COTERR_msk                   (1U << FB_STAT_COTERR_pos)

#define FB_STAT_COTWARN_pos                  8U
#define FB_STAT_COTWARN_msk                  (1U << FB_STAT_COTWARN_pos)

#define FB_STAT_RES_EVENT_pos                9U
#define FB_STAT_RES_EVENT_msk                (1U << FB_STAT_RES_EVENT_pos)

#define FB_STAT_POR_EVENT_pos               10U
#define FB_STAT_POR_EVENT_msk               (1U << FB_STAT_POR_EVENT_pos)

#define FB_STAT_DATA_ERR_pos                11U
#define FB_STAT_DATA_ERR_msk                (1U << FB_STAT_DATA_ERR_pos)

#define FB_STAT_SUP_NOK_EXT_pos             12U
#define FB_STAT_SUP_NOK_EXT_msk             (1U << FB_STAT_SUP_NOK_EXT_pos)

#define FB_STAT_SUP_NOK_INT_pos             13U
#define FB_STAT_SUP_NOK_INT_msk             (1U << FB_STAT_SUP_NOK_INT_pos)

#define FB_STAT_ERR_CHGR0_pos               14U
#define FB_STAT_ERR_CHGR0_msk               (1U << FB_STAT_ERR_CHGR0_pos)

#define FB_STAT_ERR_CHGR1_pos               15U
#define FB_STAT_ERR_CHGR1_msk               (1U << FB_STAT_ERR_CHGR1_pos)

#define FB_STAT_ERR_CHGR2_pos               16U
#define FB_STAT_ERR_CHGR2_msk               (1U << FB_STAT_ERR_CHGR2_pos)

#define FB_STAT_SPI_WD_ERR_pos              20U
#define FB_STAT_SPI_WD_ERR_msk              (1U << FB_STAT_SPI_WD_ERR_pos)

#define FB_STAT_INIT_DONE_pos               21U
#define FB_STAT_INIT_DONE_msk               (1U << FB_STAT_INIT_DONE_pos)


/* ============================================================
 * FB_VOLTAGE1
 * ============================================================ */

#define FB_VOLTAGE1_VIO_pos                  0U
#define FB_VOLTAGE1_VIO_msk                  (0x7FFU << FB_VOLTAGE1_VIO_pos)

#define FB_VOLTAGE1_VDD_pos                 11U
#define FB_VOLTAGE1_VDD_msk                 (0x7FFU << FB_VOLTAGE1_VDD_pos)


/* ============================================================
 * FB_VOLTAGE2
 * ============================================================ */

#define FB_VOLTAGE2_TEMP_VALUE_pos           0U
#define FB_VOLTAGE2_TEMP_VALUE_msk           (0x7FFU << FB_VOLTAGE2_TEMP_VALUE_pos)

#define FB_VOLTAGE2_VBAT_pos                11U
#define FB_VOLTAGE2_VBAT_msk                (0x7FFU << FB_VOLTAGE2_VBAT_pos)


/* ============================================================
 * CHIPID0
 * ============================================================ */

#define CHIPID0_ID0_pos                      0U
#define CHIPID0_ID0_msk                      (0xFFFFU << CHIPID0_ID0_pos)


/* ============================================================
 * CHIPID1
 * ============================================================ */

#define CHIPID1_ID1_pos                      0U
#define CHIPID1_ID1_msk                      (0xFFFFU << CHIPID1_ID1_pos)


/* ============================================================
 * CHIPID2
 * ============================================================ */

#define CHIPID2_ID2_pos                      0U
#define CHIPID2_ID2_msk                      (0xFFFFU << CHIPID2_ID2_pos)


#define TLE_REPLY_MODE_pos       22U
#define TLE_REPLY_MODE_msk       (0x03U << TLE_REPLY_MODE_pos)

#define TLE_REPLY_MODE_16BIT     0x00U
#define TLE_REPLY_MODE_22BIT     0x01U
#define TLE_REPLY_MODE_FAULT     0x02U

#define TLE_FAULT_1V5_pos                7U
#define TLE_FAULT_1V5_msk                (1U << TLE_FAULT_1V5_pos)

#define TLE_FAULT_2V5_pos                6U
#define TLE_FAULT_2V5_msk                (1U << TLE_FAULT_2V5_pos)

#define TLE_FAULT_BG_pos                 5U
#define TLE_FAULT_BG_msk                 (1U << TLE_FAULT_BG_pos)

#define TLE_FAULT_CLK_TOO_SLOW_pos       4U
#define TLE_FAULT_CLK_TOO_SLOW_msk       (1U << TLE_FAULT_CLK_TOO_SLOW_pos)

#define TLE_FAULT_CLK_TOO_FAST_pos       3U
#define TLE_FAULT_CLK_TOO_FAST_msk       (1U << TLE_FAULT_CLK_TOO_FAST_pos)

#define TLE_FAULT_DIG_CLK_TOO_SLOW_pos   2U
#define TLE_FAULT_DIG_CLK_TOO_SLOW_msk   (1U << TLE_FAULT_DIG_CLK_TOO_SLOW_pos)

#define TLE_FAULT_DIG_CLK_TOO_FAST_pos   1U
#define TLE_FAULT_DIG_CLK_TOO_FAST_msk   (1U << TLE_FAULT_DIG_CLK_TOO_FAST_pos)

#define TLE_FAULT_WD_REF_CLK_pos         0U
#define TLE_FAULT_WD_REF_CLK_msk         (1U << TLE_FAULT_WD_REF_CLK_pos)



typedef struct reply_16bit_
{
    uint8_t reg_data_lsb:8;
    uint8_t reg_data_msb:8;
    uint8_t rw:1;
    uint8_t status : 5;
    uint8_t reply_mode:2;
    uint8_t calc_crc : 8;
}reply_16bit_t;

typedef union reply_16bit_union_
{
    uint32_t raw;
    reply_16bit_t fields;
}reply_16bit_union_t;

typedef struct reply_22bit_
{
    uint8_t reg_data_lsb:8;
    uint8_t reg_data_msb_low:8;
    uint8_t reg_data_msb_high:6;
    uint8_t replymode : 2;
    uint8_t calc_crc : 8;
}reply_22bit_t;

typedef union reply_22bit_union_
{
    uint32_t raw;
    reply_22bit_t fields;
}reply_22bit_union_t;

typedef struct reply_critical_bit_
{
    uint8_t wd_ref_clk_flt:1;
    uint8_t dig_clk_fast_flt:1;
    uint8_t dig_clk_slow_flt:1;
    uint8_t clk_too_fast_flt:1;
    uint8_t clk_too_slow_flt:1;
    uint8_t adc_bg_flt:1;
    uint8_t supply_2v5_flt:1;
    uint8_t supply_1v5_flt : 1;
    uint8_t reserved1 : 8;
    uint8_t reserved2 : 6;
    uint8_t reply_mode : 2;
    uint8_t reserved3 : 8;
}reply_critical_bit_t;

typedef union reply_criticalbit_union_
{
    uint32_t raw;
    reply_16bit_t fields;
}reply_criticalbit_union_t;


extern reply_16bit_union_t version_value;
extern reply_16bit_union_t chipid0_value;
extern reply_16bit_union_t chipid1_value;
extern reply_16bit_union_t ch_ctrl_value;
extern reply_16bit_union_t global_config_value;
extern reply_16bit_union_t global_diag0_value;
extern reply_16bit_union_t global_diag1_value;
extern reply_16bit_union_t global_diag2_value;
extern reply_16bit_union_t vbat_th_value;
extern reply_16bit_union_t fb_frz_value;
extern reply_16bit_union_t fb_upd_value;
extern reply_16bit_union_t wd_reload_value;
extern reply_16bit_union_t diag_err_chgr_value;
extern reply_16bit_union_t diag_warn_chgr_value;
extern reply_16bit_union_t fault_mask0_value;
extern reply_16bit_union_t fault_mask1_value;
extern reply_16bit_union_t fault_mask2_value;
extern reply_16bit_union_t clk_div_value;
extern reply_16bit_union_t sff_bist_value;
extern reply_16bit_union_t pin_stat_value;

extern reply_22bit_union_t fb_stat_value;
extern reply_22bit_union_t fb_voltage1_value;
extern reply_22bit_union_t fb_voltage2_value;


extern reply_16bit_union_t set_point_value[6];

extern reply_16bit_union_t ctrl_value[6];

extern reply_16bit_union_t period_value[6];

extern reply_16bit_union_t integrator_limit_value[6];

extern reply_16bit_union_t dither_clk_div_value[6];

