rkalyan95/CmakeBackup/EmbeddedFramework/include/tle92466.h
extern reply_16bit_union_t dither_step_value[6];

extern reply_16bit_union_t dither_ctrl_value[6];

extern reply_16bit_union_t ch_config_value[6];

extern reply_16bit_union_t mode_value[6];

extern reply_16bit_union_t ton_value[6];

extern reply_16bit_union_t ctrl_int_thresh_value[6];

extern reply_22bit_union_t fb_dc_value[6];

extern reply_22bit_union_t fb_vbat_value[6];

extern reply_22bit_union_t fb_i_avg_value[6];

extern reply_22bit_union_t fb_imin_imax_value[6];

extern reply_22bit_union_t fb_i_avg_s16_value[6];

extern reply_22bit_union_t fb_int_thresh_value[6];

extern reply_22bit_union_t fb_period_min_max_value[6];


uint32_t tle_read_glb_cfg(uint16_t *glb_cfg);

uint32_t tle_read_version(uint16_t *version);

uint32_t tle_read_ch_ctrl(uint16_t *ch_ctrl);

uint32_t tle_read_glb_diag0(uint16_t *glb_diag0);

uint32_t tle_read_glb_diag1(uint16_t *glb_diag1);

uint32_t tle_read_glb_diag2(uint16_t *glb_diag2);

uint32_t tle_read_vbat_th(uint16_t *vbat_th);

uint32_t tle_read_fb_frz(uint16_t *fb_frz);

uint32_t tle_read_fb_upd(uint16_t *fb_upd);

uint32_t tle_read_wd_reload(uint16_t *wd_reload);

uint32_t tle_read_diag_err_chgr(uint8_t channel,
                                 uint16_t *diag_err_chgr);

uint32_t tle_read_diag_warn_chgr(uint8_t channel,
                                  uint16_t *diag_warn_chgr);

uint32_t tle_read_fault_mask0(uint16_t *fault_mask0);

uint32_t tle_read_fault_mask1(uint16_t *fault_mask1);

uint32_t tle_read_fault_mask2(uint16_t *fault_mask2);

uint32_t tle_read_clk_div(uint16_t *clk_div);

uint32_t tle_read_sff_bist(uint16_t *sff_bist);

uint32_t tle_read_pin_stat(uint16_t *pin_stat);

uint32_t tle_read_fb_stat(uint32_t *fb_stat);

uint32_t tle_read_fb_voltage1(uint32_t *fb_voltage1);

uint32_t tle_read_fb_voltage2(uint32_t *fb_voltage2);


uint32_t tle_write_ch_ctrl(uint16_t value);

uint32_t tle_write_glb_cfg(uint16_t value);

uint32_t tle_write_glb_diag0(uint16_t value);

uint32_t tle_write_glb_diag1(uint16_t value);

uint32_t tle_write_glb_diag2(uint16_t value);

uint32_t tle_write_vbat_th(uint16_t value);

uint32_t tle_write_fb_frz(uint16_t value);

uint32_t tle_write_fb_upd(uint16_t value);

uint32_t tle_write_wd_reload(uint16_t value);

uint32_t tle_write_diag_err_chgr(uint8_t channel, uint16_t value);

uint32_t tle_write_diag_warn_chgr(uint8_t channel, uint16_t value);

uint32_t tle_write_fault_mask0(uint16_t value);

uint32_t tle_write_fault_mask1(uint16_t value);

uint32_t tle_write_fault_mask2(uint16_t value);

uint32_t tle_write_clk_div(uint16_t value);

uint32_t tle_write_sff_bist(uint16_t value);

/*Channel regs*/

uint32_t tle_read_setpoint(uint32_t base,
                           uint8_t channel,
                           uint16_t *setpoint);

uint32_t tle_read_ctrl(uint32_t base,
                       uint8_t channel,
                       uint16_t *ctrl);

uint32_t tle_read_period(uint32_t base,
                         uint8_t channel,
                         uint16_t *period);

uint32_t tle_read_integrator_limit(uint32_t base,
                                   uint8_t channel,
                                   uint16_t *integrator_limit);

uint32_t tle_read_dither_clk_div(uint32_t base,
                                 uint8_t channel,
                                 uint16_t *dither_clk_div);

uint32_t tle_read_dither_step(uint32_t base,
                              uint8_t channel,
                              uint16_t *dither_step);

uint32_t tle_read_dither_ctrl(uint32_t base,
                              uint8_t channel,
                              uint16_t *dither_ctrl);

uint32_t tle_read_ch_config(uint32_t base,
                            uint8_t channel,
                            uint16_t *ch_config);

uint32_t tle_read_mode(uint32_t base,
                       uint8_t channel,
                       uint16_t *mode);

uint32_t tle_read_ton(uint32_t base,
                      uint8_t channel,
                      uint16_t *ton);

uint32_t tle_read_ctrl_int_thresh(uint32_t base,
                                  uint8_t channel,
                                  uint16_t *ctrl_int_thresh);


uint32_t tle_read_fb_dc(uint32_t base,
                        uint8_t channel,
                        uint32_t *fb_dc);

uint32_t tle_read_fb_vbat(uint32_t base,
                          uint8_t channel,
                          uint32_t *fb_vbat);

uint32_t tle_read_fb_i_avg(uint32_t base,
                           uint8_t channel,
                           uint32_t *fb_i_avg);

uint32_t tle_read_fb_imin_imax(uint32_t base,
                               uint8_t channel,
                               uint32_t *fb_imin_imax);

uint32_t tle_read_fb_i_avg_s16(uint32_t base,
                               uint8_t channel,
                               uint32_t *fb_i_avg_s16);

uint32_t tle_read_fb_int_thresh(uint32_t base,
                                uint8_t channel,
                                uint32_t *fb_int_thresh);

uint32_t tle_read_fb_period_min_max(uint32_t base,
                                    uint8_t channel,
                                    uint32_t *fb_period_min_max);

uint32_t tle_write_setpoint(uint8_t channel, uint16_t value);
uint32_t tle_write_ctrl(uint8_t channel, uint16_t value);
uint32_t tle_write_period(uint8_t channel, uint16_t value);
uint32_t tle_write_integrator_limit(uint8_t channel, uint16_t value);
uint32_t tle_write_dither_clk_div(uint8_t channel, uint16_t value);
uint32_t tle_write_dither_step(uint8_t channel, uint16_t value);
uint32_t tle_write_dither_ctrl(uint8_t channel, uint16_t value);
uint32_t tle_write_ch_config(uint8_t channel, uint16_t value);

uint32_t tle_write_mode(uint8_t channel, uint16_t value);
uint32_t tle_write_ton(uint8_t channel, uint16_t value);
uint32_t tle_write_ctrl_int_thresh(uint8_t channel, uint16_t value);
#endif